{
    "recipe": "Okay, here's a simple and healthy soup recipe featuring spinach and celeriac:\n\n**Creamy Celeriac and Spinach Soup**\n\nThis soup is naturally creamy thanks to the celeriac, and the spinach adds a boost of nutrients and a lovely color.\n\n**Ingredients:**\n\n*   1 medium celeriac, peeled and diced\n*   1 tablespoon olive oil\n*   1 medium onion, chopped\n*   2 cloves garlic, minced\n*   4 cups vegetable broth (or chicken broth for a richer flavor)\n*   5 ounces fresh spinach, roughly chopped\n*   Salt and pepper to taste\n*   Optional toppings: a swirl of cream, toasted croutons, grated Parmesan cheese, a squeeze of lemon juice.\n\n**Instructions:**\n\n1.  **Sauté the aromatics:** Heat the olive oil in a large pot or Dutch oven over medium heat. Add the chopped onion and cook until softened, about 5 minutes. Add the minced garlic and cook for another minute until fragrant. Be careful not to burn the garlic.\n2.  **Cook the celeriac:** Add the diced celeriac to the pot and cook for about 5 minutes, stirring occasionally, to lightly brown the edges.\n3.  **Add broth and simmer:** Pour in the vegetable broth (or chicken broth). Bring the soup to a boil, then reduce the heat to low, cover, and simmer for 15-20 minutes, or until the celeriac is tender and easily pierced with a fork.\n4.  **Blend the soup:** Carefully transfer the soup to a blender (or use an immersion blender). Blend until smooth and creamy. Be careful when blending hot liquids! If using a regular blender, blend in batches and vent the lid to release steam.\n5.  **Add the spinach:** Return the blended soup to the pot. Add the chopped spinach and cook until wilted, about 2-3 minutes.\n6.  **Season and serve:** Season the soup with salt and pepper to taste. Adjust the seasoning as needed.\n7.  **Serve:** Ladle the soup into bowls and garnish with your choice of toppings, such as a swirl of cream, toasted croutons, grated Parmesan cheese, or a squeeze of lemon juice.",
    "ingredients": [
        "spinach",
        "celeriac",
        "olive oil",
        "onion",
        "garlic",
        "vegetable broth",
        "salt",
        "pepper"
    ],
    "unowned ingredients": [
        "olive oil",
        "onion",
        "garlic",
        "vegetable broth",
        "salt",
        "pepper"
    ]
}